In [1]:
#named after Panel Data

In [3]:
#Data Frames are important can read HDF5 files

In [4]:
import numpy as np
import pandas as pd

In [5]:
labels = ['a', 'b', 'c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a' : 10, 'b': 20, 'c': 30}

In [7]:
pd.Series(my_list, index = labels) # Pandas series can hold any values

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [10]:
#DataFrames
#built directly on top of series

In [11]:
from numpy.random import randn

In [12]:
np.random.seed(101)

In [13]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'], ['W','X','Y','Z'])

In [14]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
#each column in a DataFrame is a series and shared index

In [16]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [17]:
type(df["W"])

pandas.core.series.Series

In [19]:
df.W #also works like SQL syntax

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [20]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [33]:
#creating new column by specifying column 
df['new'] = df['W'] + df['Y']

In [34]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [35]:
#removing column, have to mention axis = 1 for column and axis = 0 for rows and mention inplace = True for permanent action
df.drop('new', axis = 1, inplace = True)

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df.shape

(5, 4)

In [40]:
#Selecting rows, two ways - loc and iloc , if you know the row name use loc and if you want to check the
#location based row use iloc
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [41]:
#iloc - index position for rows
df.iloc[3]

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [42]:
df.loc['B','Y']

-0.8480769834036315

In [44]:
df.iloc[1,2]

-0.8480769834036315

In [45]:
#conditional selection 
booldf = df > 0

In [48]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df[df > 0] # direct selelection , gives the values where the values are in condition instead of the boolean values

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [53]:
df[df['W'] > 0] #. only returns the rows where the condition is satisfied in this case where W > 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
#grab all the values in the dataframe where all the values in Z are less than 0
df[df['Z'] <0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [57]:
df[df['W'] > 0]['X'] # returns the X column for the W > 0

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [64]:
df[df['W'] > 0][['Y' , 'X']] # multiple columns

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [66]:
# two or more conditions
## W > 0 and Y > 1 ## and operator doesn't work in such cases
### df[(df['W'] > 0) and (df['Y'] >1 )] - this will not work and gives and error of ambigious
#### Have to use & ampersand instead of and and it will work 
##### And - & 
###### Or - | pipe operator

In [69]:
# Reset index 
df.reset_index() # won't affect untill inplace= True

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [70]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [71]:
#split on blank space to create a list of values 
newind = 'CA NY WY OR CO'.split()

In [72]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [74]:
df['States'] = newind

In [75]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [78]:
df.set_index('States') #overwrites the index , set vs reset index and needs inplace = True

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [79]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [80]:
df[(df['W'] > 0) | (df['Y'] > 0)]

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [81]:
df[(df['W'] > 0) & (df['Y'] > 0)]

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
E  0.190794  1.978757  2.605967  0.683509     CO

In [84]:
# DataFrames part - 3
## Index Levels
### zip function with list function creates list of tuples
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) 
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [85]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [87]:
# Multilevel indexing
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [89]:
# Slicing in multilevel index 
df.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [92]:
df.index.names # pandas way of telling there is no index names

FrozenList([None, None])

In [93]:
df.index.names = ['Groups', 'Num']

In [94]:
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [96]:
df.loc['G2'].loc[2]['B']

0.19679950499134005

In [99]:
df.loc['G1'].loc[3]['B']

1.9017547952605123

In [100]:
# Cross section of rows and columns from series or columns in multilevel index situations
df.xs('G1')

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [101]:
df.xs(1,level = 'Num')

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652